
## Plan Result (system_a)

[CI link](https://github.com/nangashi/dcr/actions/runs/7364425448)


<pre><code>Plan: 13 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_lambda_layer_version.main
  * module.lambda_source.aws_s3_bucket.this[0]
  * module.lambda_source.aws_s3_bucket_public_access_block.this[0]
  * module.lambda_source.aws_s3_bucket_versioning.this[0]
  * module.monthly_aggregate.aws_cloudwatch_log_group.lambda[0]
  * module.monthly_aggregate.aws_iam_policy.logs[0]
  * module.monthly_aggregate.aws_iam_role.lambda[0]
  * module.monthly_aggregate.aws_iam_role_policy_attachment.logs[0]
  * module.monthly_aggregate.aws_lambda_function.this[0]
  * module.monthly_aggregate.aws_s3_object.lambda_package[0]
  * module.monthly_aggregate.local_file.archive_plan[0]
  * module.monthly_aggregate.null_resource.archive[0]
  * module.monthly_aggregate.null_resource.sam_metadata_aws_lambda_function[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_layer_version.main will be created
  + resource "aws_lambda_layer_version" "main" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.9",
        ]
      + created_date                = (known after apply)
      + filename                    = "./lambda/layers/layer.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "system_a_layer-prd"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "E0YZ1+8tLp0jcR613qaiit1geWNeySVRX3uJbz0V7fQ="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.lambda_source.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "system-a-source-prd"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.lambda_source.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.lambda_source.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.monthly_aggregate.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.monthly_aggregate.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/MonthlyAggregate-prd"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }
    }

  # module.monthly_aggregate.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "MonthlyAggregate-prd-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }
    }

  # module.monthly_aggregate.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "MonthlyAggregate-prd"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }
      + unique_id             = (known after apply)
    }

  # module.monthly_aggregate.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "MonthlyAggregate-prd"
    }

  # module.monthly_aggregate.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "MonthlyAggregate-prd"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + s3_bucket                      = (known after apply)
      + s3_key                         = "monthly_aggregate/9e797f2c381e5fb00e8c6228a8dc05e4adea3f11ceac4189bdef79760dd652d4.zip"
      + s3_object_version              = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = 512
        }

      + timeouts {}
    }

  # module.monthly_aggregate.aws_s3_object.lambda_package[0] will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "monthly_aggregate/9e797f2c381e5fb00e8c6228a8dc05e4adea3f11ceac4189bdef79760dd652d4.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "builds/9e797f2c381e5fb00e8c6228a8dc05e4adea3f11ceac4189bdef79760dd652d4.zip"
      + storage_class          = "ONEZONE_IA"
      + tags_all               = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }
      + version_id             = (known after apply)
    }

  # module.monthly_aggregate.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./lambda/monthly_aggregate/src/",
                      + null,
                    ],
                ]
              + filename      = "builds/9e797f2c381e5fb00e8c6228a8dc05e4adea3f11ceac4189bdef79760dd652d4.zip"
              + runtime       = "python3.9"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/9e797f2c381e5fb00e8c6228a8dc05e4adea3f11ceac4189bdef79760dd652d4.plan.json"
      + id                   = (known after apply)
    }

  # module.monthly_aggregate.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/9e797f2c381e5fb00e8c6228a8dc05e4adea3f11ceac4189bdef79760dd652d4.zip"
          + "timestamp" = "1703943541196096800"
        }
    }

  # module.monthly_aggregate.null_resource.sam_metadata_aws_lambda_function[0] will be created
  + resource "null_resource" "sam_metadata_aws_lambda_function" {
      + id       = (known after apply)
      + triggers = {
          + "built_output_path"    = "builds/9e797f2c381e5fb00e8c6228a8dc05e4adea3f11ceac4189bdef79760dd652d4.zip"
          + "original_source_code" = "\"./lambda/monthly_aggregate/src/\""
          + "resource_name"        = "aws_lambda_function.this[0]"
          + "resource_type"        = "ZIP_LAMBDA_FUNCTION"
          + "source_code_property" = "path"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":36,"Program":"tfcmt","SHA1":"003e4ed3c8630f92b63055d3c97c2631cccd641a","Target":"system_a","Vars":{},"WorkflowName":"Check Pull Requests"} -->